<template>
  <main class="pb-20">
    <!----------------------- Breadcrumb ---------------------------->
    <section class="container mx-auto xl:px-28 md:px-10 px-5">
      <nav class="flex py-6" aria-label="Breadcrumb">
        <ol class="inline-flex items-center space-x-1 md:space-x-3">
          <li
            class="inline-flex cursor-pointer items-center font-semibold text-[#5C0099] hover:text-blue-600"
          >
            Главная
          </li>
          <li>/</li>
          <li
            class="ml-1 cursor-pointer font-medium text-gray-700 hover:text-blue-600 md:ml-2"
          >
            Оплата и доставка
          </li>
        </ol>
      </nav>
    </section>
    <!----------------------- Breadcrumb end---------------------------->

    <!----------------------- section 1 ---------------------------->

    <section>
      <div class="container mx-auto xl:px-28 md:px-10 px-5">
        <h1 class="header">Доставка и оплата</h1>
        <p class="lg:w-[829px]">
          Заказывая цветы с доставкой, вы можете порадовать своих близких, даже
          если они очень далеко. Мы делаем всё возможное,чтобы выполнить каждое
          ваше поручение. Мы доставляем букеты в действительно укромные уголки
          планеты. По пути к своимадресатам нашим цветам доводилось летать
          вертолетом, плавать на пароме и ездить на снегоходе.
        </p>
      </div>
      <div class="bg-[#b058eb2c]">
        <div class="container mx-auto xl:px-28 md:px-10 px-5 pt-1 pb-8 my-5">
          <h1>Условия доставки</h1>
          <div class="flex sm:gap-12">
            <div class="flex flex-col gap-5 w-[795px]">
              <p>
                Быстрая бесплатная доставка цветов в день заказа с 9 до 21 часов
                по местному времени. Для доставки в другие часы нужна доплата.
                При оплате заказа с доставкой по Узбекистан до 14:00 (по
                местному времени получателя), либо до 12:00 для заказов в другие
                страны, ваш букет может быть подарен в тот же день.
              </p>
              <p class="text-[#5C0099]">
                Когда нужно доставить цветы день-в-день в страны с большой
                временной разницей, состав букета может быть изменен.
              </p>
              <p class="-mr-10">
                Если адресом доставки букета является гостиница или отель, мы
                можем гарантировать доставку только до ресепшен. Для успешной
                доставки вашего заказа необходимо указывать номер комнаты, в
                которой проживает получатель и его сотовый номер, чтобы сообщить
                ему о доставленном подарке.
              </p>
              <p class="text-[#5C0099] underline">Условия сервиса</p>
            </div>
            <div>
              <svg
                class="ml-5"
                width="51"
                height="51"
                viewBox="0 0 51 51"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M30.8215 0.561359L33.6733 20.2015L50.439 30.8211L30.7989 33.6729L20.1793 50.4387L17.3275 30.7985L0.561749 20.1789L20.2019 17.3271L30.8215 0.561359Z"
                  fill="#AC7EC9"
                />
              </svg>
              <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M19.5068 0.365936L21.3108 12.7897L31.9163 19.5073L19.4926 21.3112L12.775 31.9167L10.971 19.493L0.365509 12.7754L12.7892 10.9714L19.5068 0.365936Z"
                  fill="#AC7EC9"
                />
              </svg>
            </div>
          </div>
        </div>
      </div>
      <div
        class="container md:flex w-full gap-5 mx-auto xl:px-28 md:px-10 px-5 pt-1 pb-8 my-5"
      >
        <div
          class="bg-green-100 rounded-xl p-7 sm:w-[540px] lg:text-md text-sm md:pt-0 md:mt-0 pt-1 xl:min-w-[540px]"
        >
          <h1>Обратите внимание</h1>
          <div>
            <p>
              28-31 декабря, 13–14 февраля, 6–7–8 марта — дни, когда количество
              заказов вырастает в несколько раз.
            </p>
            <p>
              <br />
              В эти дни мы принимаем заказы без обещания доставить в точное
              время. Все заказы на праздники, оформленные заранее, выполняются в
              назначенное время.
            </p>
          </div>
        </div>
        <div
          class="bg-orange-100 rounded-xl p-7 sm:w-[540px] lg:text-md text-sm md:pt-0 md:mt-0 mt-5 pt-1 xl:min-w-[540px]"
        >
          <h1>Конфиденциально</h1>
          <div>
            <p>
              Вся информация, предоставляемая вами, строго конфиденциальна и
              недоступна третьим лицам.
            </p>
            <p>
              <br />
              В любой момент вы можете уточнить состояние своей заявки в личном
              кабинете или по ссылке статус заказа. По факту доставки, мы
              пришлем вам сообщение по электронной почте и SMS.
            </p>
          </div>
        </div>
      </div>

      <!-------------  -------------->
      <div class="container mx-auto xl:px-28 md:px-10 px-5 -mt-5">
        <h1>Оплата заказа</h1>
        <p class="lg:w-[760px]">
          Оплачивайте заказ сразу после оформления удобным для вас способом.
          Также мы пришлемписьмо-подтверждение с необходимыми ссылками, если вы
          решите оплатить заказ позже.
        </p>
      </div>
    </section>
  </main>
</template>

<script setup></script>

<style lang="scss" scoped>
h1 {
  font-weight: 600;
  font-size: 24px;
  margin: 20px 0;
}

.header {
  font-size: 32px;
  margin-top: -10px;
}

@media (max-width: 768px) {
  .header {
    font-size: 25px;
  }

  h1 {
    font-size: 18px;
    margin: 15px 0;
  }

  p {
    font-size: 12px;
  }
}
</style>
